{
    "adventure_title" : "Pythonbeard the cyborg pirate",
    "chapters"        : [
        {
            "key"    : 0,
            "title"  : "Introduction",
            "story"  : ["Well... you know you are a cyborg but not much else. You here some",
                        "voice saying \"Quick some water got in his head, reboot him and ",
                        "make sure he responses\" a second voice pops and says:"],
            "riddle" : ["\"CAPTAIN! CAPTAIN! Answer with 'hello world' if you can here me\"",
                        "(write you answer in brain_module.py)"],
            "hint"   : "use the command print in order to print hello world",
            "answer" : "fdbd8e75a6"
        },
        {
            "key"    : 1,
            "title"  : "Stormy Sail",
            "story"  : ["\"Are you conscious? Can you speak with me?\". You are starting to",
                        "understand that you are in the middle of a massive thunderstorm.",
                        "\"Are you OK?\" the voice started whipping \"I think a thunder hit",
                        "him, what should I do?\". "],
            "riddle" : ["SPEAK with him. Just fix the 'Ahoy matey' string to you speaking module",
                        "to let him know you are fine." ],
            "hint"   : "In the speak function return the 'Ahoy matey' string (the result is case sensitive)",
            "answer" : "3c103876f8"
        },
        {
            "key"    : 2,
            "title"  : "Tight Spots",
            "story"  : ["\"Thank god you're up, we need you calculations. We had the worst luck I've",
                        "ever seen. The storm caught us in the worst place\". \"Why? where are we?\"",
                        "\"What's the matter with you?\" the voice snapped \"We're in the SEA OF THE",
                        "VERY SHARPS ROCKS and we need your fast calculations to check where we should pass\".",
                        "Don't tell him but you arithmetic unit is fucked up right now. Luckily the vision is just fine"],
            "riddle" : ["write a quick patch to compare the width of the ship and the width of the path",
                        "return true if you can pass and false if you need to find a new path." ],
            "hint"   : "The text says how to compare.",
            "answer" : "562109b054"
        },
        {
            "key"    : 3,
            "title"  : "Sea Breeze",
            "story"  : ["\"Few.. Finally got out of that damned place, that was a close call you know...\"",
                        "said the voice \"Are you Fine captain? you behave weirdly? Why are looking at me",
                        "like this?\". \"I fill fine matey\" you answered. \"It's like you don't even know me...",
                        "Do you even know my name?\" he said back. You realize that you really did forgot",
                        "his name."],
            "riddle" : ["Try pulling from your subconscious the first name you know." ],
            "hint"   : "help('some type') will help you handle that type.",
            "answer" : "c05ec17b6e"
        },
        {
            "key"    : 4,
            "title"  : "That Was Weird",
            "story"  : ["You noticed immediately... You have said your own name. \"That water drop really",
                        "fucked you up\" he said \"Who thought that sending a robot to be a pirate was",
                        "a good idea?\". \"You filthy rat, watch how you talk to you're captain\" you",
                        "answered. \"Lets see if you are fixable... My name start with 'Bo' can you",
                        "say my name now?\""],
            "riddle" : ["Prove him that you can handle anything. Pull from our subconscious the first name",
                        "which starts with 'Bo'" ],
            "hint"   : "Try reading about for/while loops and if statements.",
            "answer" : "b7808c5991"
        },
        {
            "key"    : 5,
            "title"  : "Find a Way",
            "story"  : ["\"So You know my name... That doesn't prove anything... Lets see if you",
                        "can find your path to the north\" Bob whined. \"How dare you challenge me?\"",
                        "You shouted \"That's not even hard\". You did remember that the north is",
                        "and always was under the brightest star (obviously wrong but got enough for",
                        "the training)."],
            "riddle" : ["Look at the sky and search for the star with the maximum brightness"],
            "hint"   : "Read about the max method, it can also be found using for loops.",
            "answer" : "580adf23c3"
        },
        {
            "key"    : 6,
            "title"  : "Lets sail",
            "story"  : ["\"So you are not that fucked up. I think we'll manage\" Bob said \"Here's what",
                        "you will need to know: if we are in the open sea we can SAIL_FAST. 2: if we are",
                        "in shallow water then we need to SAIL_SLOW. 3: for the moral of the crew",
                        "STOP if you can spot a whale\"."],
            "riddle" : ["Write an autopilot method for the sailing. use the code constants"],
            "hint"   : "Read about if/else statements.",
            "answer" : "0f5f8724b1"
        },
        {
            "key"    : 7,
            "title"  : "Parking",
            "story"  : ["That was a great sail, and you and your crew even got to see a whale on your way.",
                        "You are now at the biggest pirate colony 'GitHub' where the worst gits around",
                        "the world love to hangout. Resulting a massive parking problem. Lets try sailing",
                        "along the canal and see if there is any place big enough to place your ship."],
            "riddle" : ["Search a perfect parking spot meaning, just big enough for the ship.",
                        "Closest to the size from above."],
            "hint"   : "Useful methods can be: for, min, (list_object).index(item)",
            "answer" : "6af11c8358"
        },
        {
            "key"    : 8,
            "title"  : "Search Yourself",
            "story"  : ["\"That was a great parking captain\" said Bob \"But I think we must be in the",
                        "books\". A man came to you and said \"The books mister. You mustn't park here",
                        "unless you are written here\". He gives you the book, you opened it thinking",
                        "1. Why there are books in the place of the worst pirates? 2. You probably in the",
                        "books 3. You forgot how to read..."],
            "riddle" : ["Write a file reading module for Pythonbeard and search his name if the given file",
                        "You do understand that each line is a new name."],
            "hint"   : "You need a for loop, the open() function and readline. search online there are many examples",
            "answer" : "606e2772cb"
        },
        {
            "key"    : 9,
            "title"  : "A Strange Man",
            "story"  : ["\"Well that was an hustle...\" said Bob \"I think i need an ale right now...",
                        "Are you coming\". Well... You don't anything better to do right now. You get",
                        "to The \"Sunken Norwegian\" and you see there a weird man talking \"There is a place",
                        "called Atlantis! It's real. You can even go there if you don't believe me.\" You can",
                        "see him taking out an old map. He sees you and starts talking with you:"],
            "riddle" : ["\"It's right here in the middle of the Bermuda Triangle\" he pointed at the triangle.",
                        "Calculate where the center is. All you get are three coordinates."],
            "hint"   : "Search how can you find the centroid of a triangle on a graph.",
            "answer" : "e83eff1cdb"
        },
        {
            "key"    : 10,
            "title"  : "Map Reading",
            "story"  : ["\"Wow!!! that was the fastest calculation I've ever seen. What are you?",
                        "never mind take this map, you must find it.\" The strange man gives you",
                        "his map. \"You know you can't go underwater right?\" Bob noted (Well shut",
                        "up Bob. One more comment like this one and I'll murder you). \"Anyway... we can't just",
                        "go and sail we need to calculate our way precisely and sort the destinations\""],
            "riddle" : ["I've already picked up out checkpoints, but can you sort them please?",
                        "Assume you are at Point(0, 0). Sort points by distance from you."],
            "hint"   : "Use the sorted function",
            "answer" : "6f9279e958"
        },
        {
            "key"    : 11,
            "title"  : "Lets Sail Again",
            "story"  : ["\"We are going to sail again pythonbeard but lets make sure you are prepared\"",
                        "announced bob \"Now we need to make sure the wind help our ship proceed,",
                        "If the wind speed is greater then 20km/h our sails should be half way down",
                        "If the wind speed is lower then or equal to 20km/h our sails should be three",
                        "quarters down and if the wind is slower the 11km/h our sails should be down.\""],
            "riddle" : ["Implement the given instructions."],
            "hint"   : "Make sure the units are correct",
            "answer" : "875a99b10c"
        },
        {
            "key"    : 12,
            "title"  : "The Kraken",
            "story"  : ["\"WTF what are those?\" Shouted Bob while he pointed to sky. \"It's the Kraken\"",
                        "You heard a sailor shouting. \"Not again!\" he shouted \"Why it always happens",
                        "to me?!?\". You look a the sky and see giant tentacles crawling upwards.",
                        "\"We need to shoot his wick spots quickly, find them and tell me where to shoot\"",
                        ""],
            "riddle" : ["Luckily your vision can spot strength of points.",
                        "Write a function which finds the 10 weakest point in a given array."],
            "hint"   : "List slicing can be very helpful.",
            "answer" : "609f4a40a4"
        },
        {
            "key"    : 13,
            "title"  : "Deserted Island",
            "story"  : ["Everything is black. You click your vision button, you're starting to remember what",
                        "happened... [Flashback: Bob: \"How can you see how strong a point is? It doesn't",
                        "make any sense\"] 'Stupid Bob' you thought 'The man told us not to comment",
                        "on the story or he will murder us'. You regain your vision and you see the sunset.",
                        "The sunset is breathtaking but you need to start a fire."],
            "riddle" : ["Write in your adventure module a function which returns 'push' and 'pull' alternately.",
                        "This function should be 'endless' meaning whenever it gets called it return the matching command."],
            "hint"   : "Read about python Generators.",
            "answer" : "f20d98df86"
        },
        {
            "key"    : 14,
            "title"  : "Find a Way Out",
            "story"  : ["After a short nap, you wake up and start to walk into the entangled jungle.",
                        "",
                        "",
                        "",
                        ""],
            "riddle" : ["Write a function which selects the open path.",
                        "If you haven't tried yet challenge your self with list comprehension"],
            "hint"   : "Use the filter method.",
            "answer" : "979324f1e3"
        },
        {
            "key"    : 15,
            "title"  : "Read the Code",
            "story"  : ["While you were finding your way out you see saw a massive door",
                        "above it you see \"xlivi mw e qet wyfqevmri erh e aixwymx ", 
                        "hsarxlivi rs pmi\". you believe that this text was ciphered",
                        "to confuse the intruders.",
                        ""],
            "riddle" : ["Try to decipher if the code. (below that you see the text c4).",
                        ""],
            "hint"   : "The C stands for caesar and the 4 is the key. strings a immutable.",
            "answer" : "2a786e5124"
        },
        {
            "key"    : 16,
            "title"  : "Into the Unknown",
            "story"  : ["You walk through the door into the unknown and you see a submarine,",
                        "a wetsuit and a map. On the map you see a point marked a Atlantis.",
                        "On the other side of the map you see a text saying \"Atlantis bing",
                        "houmbala bam bang, shonta houmba sembe hercumba er tang Atlantis shing",
                        "Daraga\" you recognize it as Atlasian (the language of Atlantis)"],
            "riddle" : ["Fetch the dictionary from you subconscious and translate the text.",
                        ""],
            "hint"   : "The dictionary is a normal python dictionary, check how to use it.",
            "answer" : "0b28ba3d05"
        },
        {
            "key"    : 17,
            "title"  : "New Crew",
            "story"  : ["What? Atlantis is in danger? You must save them, but first we need",
                        "a crew. Again the luck is with you, you know how to navigate the submarine",
                        "and you have a map for GitHub. You reach again to the 'Sunken Norwegian'",
                        "and you see the name and price list of all the assassins. You realize",
                        "you lost all you money to the kraken. (The task is clearer in the hint)"],
            "riddle" : ["The strange man reaches you and says \"You lost all the old homies to",
                        "kraken, so Atlantis is in danger you say take my money(50 shemekels) and hire new crew\""],
            "hint"   : "Hire as many assassins as you can with the strange man's money.",
            "answer" : "8c2d7c7d52"
        },
        {
            "key"    : 18,
            "title"  : "Atlantis",
            "story"  : ["'I can believe it' you said to yourself 'We're finally here. The trip with",
                        "the submarine is so much easier'. You reached a massive underwater gate",
                        "and you see a transcript saying. 'In order to reach in you must prove you",
                        "knowledge of the roman numeral counting, you will see a series of numbers",
                        "write back the matching number in normal numbers'."],
            "riddle" : ["Write a roman numeral to normal numbers translator.",
                        "(I -> 1, II -> 2, IV -> 4, V -> 5, X -> 10, XL -> 40, L -> 50 ...)"],
            "hint"   : "Ordering has a big impact in this method.",
            "answer" : "d09f30c4b8"
        },
        {
            "key"    : 19,
            "title"  : "Challenge of the Queen",
            "story"  : ["\"INTRUDER!\" you here a loud shout from behind you. The submarine was",
                        "dragged into a huge castle. the guards took you out and through you in",
                        "a massive hall, in the edge of the hall you see the queen of Atlantis",
                        "\"Who are you?\" she asked. You took out the note and she took it from you",
                        "\"How? Why? You?\" she asked bamboozled \"OK then answer me that...\""],
            "riddle" : ["\"In how many ways can you place 8 chess queens on an 8x8 chess board",
                        "without them threatening each other?\""],
            "hint"   : "This problem can be solved using a recursion, read want this is",
            "answer" : "ba888e6361"
        },
        {
            "key"    : 20,
            "title"  : "The Caves",
            "story"  : ["\"This is him\" the queen was shocked \"That's the one we searched for...",
                        "Only he can save us from the dragon in the caves. He's the one who plays",
                        "chess\" the queen started walking and you followed into a tight cave. \"Go there\"",
                        "she said, \"the dragon will attack soon, we need to find him and attack him",
                        "first. call me when you're there I'll bring the army.\""],
            "riddle" : ["Write an algorithm which help you reach the end of the cave.",
                        ""],
            "hint"   : "Read about backtracking in programing.",
            "answer" : "147d6e4977"
        },
        {
            "key"    : 21,
            "title"  : "The Sphinx",
            "story"  : ["\"Who is the pirate which disturbs my sleep?\" A deep voice echo through",
                        "the caves. \"It is I, Pythonbeard, I need to pass and find the dragon to",
                        "save the city of Atlantis\" you answered. \"Then first answer me that...\"",
                        "",
                        ""],
            "riddle" : ["\"In the language of the mighty regex gods write a law which defines",
                        "a roman number\" return a regular expression string"],
            "hint"   : "Learn about regular expression",
            "answer" : "613c4d6741"
        },
        {
            "key"    : 22,
            "title"  : "Call the Queen",
            "story"  : ["\"You shell pass\" said the sphinx. You continue going down the caves and",
                        "now you can see the gangetic sleeping blue water dragon.",
                        "",
                        "",
                        ""],
            "riddle" : ["Using simple TCP Socket sent the queen the message \"The dragon his here\"",
                        "the ip of the queen is 127.0.0.1 at port 4200"],
            "hint"   : "You need to learn about socket.",
            "answer" : ""
        },
        {
            "key"    : 23,
            "title"  : "The War",
            "story"  : ["This is it... you here a massive army going down the path you sent them...",
                        "The reach the sphinx and give your answer. They reach the dragon and start",
                        "to fight him... and he fights back hard. But you know... That with enough",
                        "effort using python you can demolish and fight through anything that comes up.",
                        "Now you have most of the modules and you can manage on you own."],
            "riddle" : ["Press enter and the game will end",
                        ""],
            "hint"   : "You were pythonbeard all this time and you wrote you own python modules",
            "answer" : ""
        }
    ]
}