{
    "adventure_title" : "Pythonbeard the cyborg pirate",
    "chapters"        : [
        {
            "key"    : 0,
            "title"  : "Introduction",
            "story"  : ["Well... you know you are a cyborg but not much else. You here some",
                        "voice saying \"Quick some water got in his head, reboot him and ",
                        "make sure he responses\" a second voice pops and says:"],
            "riddle" : ["\"CAPTAIN! CAPTAIN! Answer with 'hello world' if you can here me\"",
                        "(write you answer in brain_module.py)"],
            "hint"   : "use the command print in order to print hello world",
            "answer" : "fdbd8e75a6"
        },
        {
            "key"    : 1,
            "title"  : "Stormy Sail",
            "story"  : ["\"Are you conscious? Can you speak with me?\". You are starting to",
                        "understand that you are in the middle of a massive thunderstorm.",
                        "\"Are you OK?\" the voice started whipping \"I think a thunder hit",
                        "him, what should I do?\". "],
            "riddle" : ["SPEAK with him. Just fix the 'Ahoy matey' string to you speaking module",
                        "to let him know you are fine." ],
            "hint"   : "In the speak function return the 'Ahoy matey' string (the result is case sensitive)",
            "answer" : "3c103876f8"
        },
        {
            "key"    : 2,
            "title"  : "Tight Spots",
            "story"  : ["\"Thank god you're up, we need you calculations. We had the worst luck I've",
                        "ever seen. The storm caught us in the worst place\". \"Why? where are we?\"",
                        "\"What's the matter with you?\" the voice snapped \"We're in the SEA OF THE",
                        "VERY SHARPS ROCKS and we need your fast calculations to check where we should pass\".",
                        "Don't tell him but you arithmetic unit is fucked up right now. Luckily the vision is just fine"],
            "riddle" : ["write a quick patch to compare the width of the ship and the width of the path",
                        "return true if you can pass and false if you need to find a new path." ],
            "hint"   : "Check \"Comparisons\" in the cheat sheet to see how to write comparisons",
            "answer" : "562109b054"
        },
        {
            "key"    : 3,
            "title"  : "Sea Breeze",
            "story"  : ["\"Few.. Finally got out of that damned place, that was a close call you know...\"",
                        "said the voice \"Are you Fine captain? you behave weirdly? Why are looking at me",
                        "like this?\". \"I fill fine matey\" you answered. \"It's like you don't even know me...",
                        "Do you even know my name?\" he said back. You realize that you really did forgot",
                        "his name."],
            "riddle" : ["Try pulling from your subconscious the first name you know." ],
            "hint"   : "help('some type') will help you handle that type.",
            "answer" : "c05ec17b6e"
        },
        {
            "key"    : 4,
            "title"  : "That Was Weird",
            "story"  : ["You noticed immediately... You have said your own name. \"That water drop really",
                        "fucked you up\" he said \"Who thought that sending a robot to be a pirate was",
                        "a good idea?\". \"You filthy rat, watch how you talk to you're captain\" you",
                        "answered. \"Lets see if you are fixable... My name start with 'Bo' can you",
                        "say my name now?\""],
            "riddle" : ["Prove him that you can handle anything pull from our subconscious the first name",
                        "which starts with 'Bo'" ],
            "hint"   : "Try reading about for/while loops and if statements.",
            "answer" : "b7808c5991"
        },
        {
            "key"    : 5,
            "title"  : "Lets sail",
            "story"  : ["\"So you are not that fucked up. I think we'll manage\" Bob said \"Here's what",
                        "you will need to know: if we are in the open sea we can SAIL_FAST. 2: if we are",
                        "in shallow water then we need to SAIL_SLOW. 3: for the moral of the crew",
                        "STOP if you can spot a whale\"."],
            "riddle" : ["Write an autopilot method for the sailing. use the code constants"],
            "hint"   : "Reading about if/else statements.",
            "answer" : "0f5f8724b1"
        }
    ]
}