{
    "adventure_title" : "Pythonbeard the cyborg pirate",
    "chapters"        : [
        {
            "key"    : 0,
            "title"  : "Introduction",
            "story"  : ["Well... you know you are a cyborg and you know your name is pythonbeard. ",
                        "Not much else. You here some voice saying \"Quick some water got in ",
                        "his head, reboot him and make sure he response\" a second voice pops and says:"],
            "riddle" : ["\"CAPTAIN! CAPTAIN! Answer with 'hello world' if you can here me\"",
                        "(write you answer in brain_module.py)"],
            "hint"   : "use the command print in order to print hello world",
            "answer" : "fdbd8e75a6"
        },
        {
            "key"    : 1,
            "title"  : "Stormy Sail",
            "story"  : ["\"Are you conscious? Can you speak with me?\". You are starting to",
                        "understand that you are in the middle of a massive thunderstorm.",
                        "\"Are you OK?\" the voice started whipping \"I think a thunder hit",
                        "him, what should I do?\". "],
            "riddle" : ["SPEAK with him. Just fix the 'Ahoy matey' string to you speaking module",
                        "to let him know you are fine." ],
            "hint"   : "In the speak function return the 'Ahoy matey' string (the result is case sensitive)",
            "answer" : "3c103876f8"
        },
        {
            "key"    : 2,
            "title"  : "Tight Spots",
            "story"  : ["\"Thank god you're up, we need you calculations. We had the worst luck I've",
                        "ever seen. The storm caught us in the worst place\". \"Why? where are we?\"",
                        "\"What's the matter with you?\" the voice snapped \"We're in the SEA OF THE",
                        "VERY SHARPS ROCKS and we need your fast calculations to check where we should pass\".",
                        "Don't tell him but you arithmetic unit is fucked up right now luckily the vision is just fine"],
            "riddle" : ["write a quick patch to compare the width of the ship and the width of the path",
                        "return true if you can pass and false if you need to find a new path." ],
            "hint"   : "Check \"Comparisons\" in the cheat sheet to see how to write comparisons",
            "answer" : "562109b054"
        }
    ]
}